{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "albert/albert-base-v2",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 8,
  "lora_dropout": 0.0,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [
    "qa_outputs"
  ],
  "peft_type": "LORA",
  "r": 9,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "query"
  ],
  "task_type": "QUESTION_ANS",
  "use_dora": false,
  "use_rslora": false
}